<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.AdwareMedic</string>
	<key>Input</key>
	<dict>
		<key>APPCAST_URL</key>
		<string>http://www.adwaremedic.com/versions/updates.xml</string>
		<key>APP_DESTINATION</key>
		<string>/Applications/Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>NAME</key>
		<string>AdwareMedic</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>AdMedic is an application for Mac OS X designed to remove all known adware from your computer.
            It is very simple to use, and should clean up your system in less than a minute, from start to finish.</string>
			<key>developer</key>
			<string>Thomas Reed</string>
			<key>display_name</key>
			<string>Adware Medic</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.wardsparadox.adwaremedic.munki</string>
</dict>
</plist>
