<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.BlueJ</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://www.bluej.org</string>
		<key>DOWNLOAD_URL</key>
		<string>%BASE_URL%/versions.html</string>
		<key>MUNKI_CATEGORY</key>
		<string>Programming</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>BlueJ</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>A free Java Development Environment designed for beginners, used by millions worldwide.</string>
			<key>developer</key>
			<string>BlueJ</string>
			<key>display_name</key>
			<string>BlueJ</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.munki.BlueJ</string>
</dict>
</plist>
