<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.MalwarebytesAntiMalware</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Security</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Malwarebytes</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://data-cdn.mbamupdates.com/v1/mbam-mac/updates.xml</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Formerly known as Adware Medic, MalwareBytes will scan for and remove popular adware on Macs.</string>
			<key>developer</key>
			<string>Malwarebytes</string>
			<key>display_name</key>
			<string>Malwarebytes Anti-Malware</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.aysiu.munki.MalwarebytesAntiMalware</string>
</dict>
</plist>
