<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.MySQLWorkBench</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>MySQL</string>
		<key>NAME</key>
		<string>MySQLWorkBench</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>MySQL Workbench is a unified visual tool for database architects, developers, and DBAs.</string>
			<key>category</key>
			<string>Database</string>
			<key>developer</key>
			<string>Oracle</string>
			<key>icon_name</key>
			<string>MySQLWorkbench.png</string>
			<key>display_name</key>
			<string>MySQL Workbench</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.cgerke-recipes.munki.MySQLWorkBench</string>
</dict>
</plist>
