<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.VMwareHorizonClient</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>vmware</string>
		<key>NAME</key>
		<string>view</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https://download3\.vmware\.com/software/view/viewclients/CART\d\dQ\d/VMware-Horizon-Client-(?P&lt;version&gt;[\d\.\-]+)\.dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://my.vmware.com/web/vmware/details?downloadGroup=VIEWCLIENTS_MAC_35&amp;productId=421&amp;rPId=8672</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>VMware Horizon Client for Mac allows you to connect to your VMware Horizon virtual desktop from your device of choice giving you on-the-go access from any location.</string>
			<key>developer</key>
			<string>VMware</string>
			<key>display_name</key>
			<string>VMware Horizon Client for Mac</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
/Applications/VMware\ Horizon\ Client.app/Contents/Library/InitUsbServices.tool
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.munki.VMwareHorizonClient</string>
</dict>
</plist>
