<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Disk Inventory X.</string>
	<key>Identifier</key>
	<string>com.github.sethku.download.DiskInventoryX</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://www.derlien.com/download.php?file=DiskInventoryX</string>
		<key>NAME</key>
		<string>Disk Inventory X</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
         <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been replaced by: https://github.com/autopkg/dataJAR-recipes/tree/master/Disk%20Inventory%20X. Please use the recipes in the dataJAR-recipes repo instead.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
